
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10538893676)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> "functions/src_72b41b5f44b5a135f1c802f02c70560e.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> "functions/src_72b41b5f44b5a135f1c802f02c70560e.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> "functions/src_72b41b5f44b5a135f1c802f02c70560e.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "TnxyOQ==" -> (known after apply)
      ~ detect_md5hash      = "jLi0wk1mdZt8MemEaDohEA==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-deploy-functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "jLi0wk1mdZt8MemEaDohEA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_8cb8b4c24d66759b7c31e984683a2110.zip?generation=1724109076317820&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> "functions/src_72b41b5f44b5a135f1c802f02c70560e.zip" # forces replacement
      ~ output_name         = "functions/src_8cb8b4c24d66759b7c31e984683a2110.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_8cb8b4c24d66759b7c31e984683a2110.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1264,"Program":"tfcmt","SHA1":"331d21782ff636c933e719a3d6fdb48aed447a76","Vars":{},"WorkflowName":"CI / Infrastructure Production"} -->